<?


/* листы
простые листы разрешения
2063x1528 
1031x764
515x382
257x191
128x95

top_chap
9600х5400
4800х2700
2400х1350
1200х675
600х337
300х168
150х84
*/
/*
LR0039
3-4
12-13
21-22
30-35
41-44
50-53
56
61-63
67-68
70-71
74
76
78


LR0040
1-2
5-6
10-11
14-15
19-20
23-24
28-31
37-40
46-49
55
57
60-62
65-66
70-71
73
76
78


LR0041
5-6,14-15,19-20,23-24,28-35,39-40,43-44,48-49,52-53,57,60-63,66,68,70-71,73-74,76,78

LR0042
1-4,10-13,19-22,30-33,39-42,48-51,55-56,60-62,66-67,70-71,73-74,76,78

LR0043
5-8,14-17,23-26,29-31,34-35,37-40,43-44,46-49,52-53,57-58,60-63,65-66,68,70-71,73-74,76,78

LR0044
21-22,30-33,41-42,50-51,61-62,67,70-71,74,76,78

LR0045
1-2,10-11,19-22,30-33,41-42,50-51,55,60-62,67,70-71,74,76,78

LR0046
7-8,16-17,19-20,25-26,28-31,39-40,48-49,58,60-61,63,66,70-71,73,76,78

LR0047
5-8,14-17,21-26,30-31,34-35,43-44,52-53,57-58,61-63,68,70-71,74,76,78

LR0050
16,17,25,26,58,63,71,76,78

LR0051
7,8,16,17,58,71,76,78

LR0052
39,40,48,49,66,73,76,78

LR0054
19,20,28,29,37,38,60,65,70,73,76,78

LR0055
5,6,14,15,57,71,76,78
LR0057
23,24,32,33,41,42,62,67,71,74,76,78
LR0058
7,8,16,17,23,24,32,33,41,42,58,62,67,71,74,76,78
LR0060
7,8,16,17,37,38,46,47,58,65,71,73,76,78
LR0063
10,11,19,20,55,60,70,76,78
LR0064
16,17,25,26,58,63,71,76,78


закрыто слева.
LR0082,91,104,108,129,169
5-9,14-18,23-27,32-36,41-45,50-54,57-59,62-64,67-69,71-72,74-78

закрыто справа
88,115,156
1-5,10-14,19-23,28-32,37-41,46-50,55-57,60-62,62-67,70-71,73-74,76,78
*/


/* top_chap1 список открытых листов  _b  годен и для закрытых
241-254 это от закрытых(_а)
279-292
317-330
355-368
393-406
431-444
469-482
507-520
900-906
919-925
938-944
957-963
1059-1062
1069-1072
1079-1082
1107-1109
1112-1114
1121-1122
1127
1129
*/

/* top_chap2 список открытых листов  _b
356-367
393-405
431-443
469-479
507-517
919-925
938-944
957-962
1069-1072
1079-1081
1112-1114
1121-1122
1127
1129

для закрытых с текстом _а
245-249,279-283,355-368,393-406,431-444,469-479,507-517,900-904,919-925,938-944,957-962,1059-1062,1069-1072,1079-1081,1107-1108,1112-1114,1121-1122,1127,1129
*/

/*  top_chap3 список открытых листов  _b
319-325
327-330
357-363
365-368
395-399
401-403
433-437
439-441
471-475
509-513
920-925
939-943
958-960
1069-1072
1079-1080
1112-1114
1121-1122
1127
1129

список закрытых с текстом _а
241-245
248-254
317-330
355-368
393-404
431-442
469-477
507-515
900-906
919-925
938-944
957-961
1059-1062
1069-1072
1079-1081
1107-1109
1112-1114
1121-1122
1127
1129


*/

/* top_chap4  _b нету.
241-245
247-250
317-330
355-368
393-406
436-441
474-479
512-514
550-552
900-906
919-925
938-944
959-962
978-980
1059-1062
1069-1072
1080-1081
1107-1109
1112-1114
1121-1122
1127
1129


*/


/* top_chap5  список открытых листов  _b
318-319
321-322
356-357
359-360
365-366
396-397
403-404
434-435
439
477
515
919-921
924
939-940
942-943
961
1069-1071
1081
1112-1113
1121-1122
1127
1129


список закрытых с текстом _а
245-249
279-285
318-322
325-329
356-366
394-404
432-435
439-442
470-474
477-480
508-512
515-518
900-906
919-925
938-943
957-962
1059-1062
1069-1072
1079-1082
1107-1108
1112-1114
1121-1122
1127
1129






*/


/* top_chap6 список открытых листов  _b
278-292
316-330
354-368
392-406
430-444
468-474
506-512
544-550
899-906
918-925
937-944
956-959
975-978
1058-1062
1068-1072
1078-1080
1107-1109
1112-1114
1121-1122
1127
1129


список закрытых с текстом _а
245-249
278-292
316-330
354-368
392-406
430-444
468-474
506-512
544-550
899-906
918-925
937-944
956-959
975-978
1058-1062
1068-1072
1078-1080
1107-1109
1112-1114
1121-1122
1127
1129




*/

/* top_chap7 список открытых листов  _b
284-286
318-320
322-324
326-329
356-358
360-362
364-367
394-396
402-405
432-434
440-442
470-472
474-476
478-480
512-514
902-903
919-925
938-939
942-944
957-962
1060
1069-1072
1079-1081
1108
1112-1114
1121-1122
1127
1129
список закрытых с текстом _а
241-252
279-292
317-330
356-367
394-405
431-443
470-481
508-519
549-556
900-906
919-925
938-944
957-963
978-980
1059-1062
1069-1072
1079-1082
1107-1109
1112-1114
1121-1122
1127
1129
*/

/* top_thum список открытых листов  _b
249-255
278-293
316-319
321-331
355-357
359-365
367-369
393-394
398-399
401-403
432
436-437
440-441
468-483
506-521
544-552
899-907
918-926
938-943
956-964
975-979
1058-1062
1068-1072
1078-1082
1107-1109
1112-1114
1121-1122
1127
1129

список закрытых с текстом _а
240-255
278-293
316-331
354-369
392-407
430-445
468-483
506-521
544-554
899-907
918-926
937-945
956-964
975-980
1058-1062
1068-1072
1078-1082
1107-1109
1112-1114
1121-1122
1127
1129

*/



//для массива размеры
$простые_листы = array("2063" => "1528", "1031" => "764", "515" => "382", "257" => "191", "128" => "95");
$top_chap = array("9600" => "5400", "4800" => "2700", "2400" => "1350", "1200" => "675", "600" => "337", "300" => "168", "150" => "84");
$top0001 = array("6400" => "3600", "3200" => "1800", "1600" => "900", "800" => "450", "400"=>"225","200"=>"122");

//для частичной нарезки
$top_chap1_только_открытые_низ = array(241,279,317,355,393,431,469,507,900,919,938,957,1059,1069,1079,1107,1112,1121,1127,1129);
$top_chap1_только_открытые_верх = array(254,292,330,368,406,444,482,520,906,925,944,963,1062,1072,1082,1109,1114,1122,1127,1129);

$top_chap2_только_открытые_низ = array(356,393,431,469,507,919,938,957,1069,1079,1112,1121,1127,1129);
$top_chap2_только_открытые_верх = array(367,405,443,479,517,925,944,962,1072,1081,1114,1122,1127,1129);

$top_chap2_только_закрытые_низ = array(245,279,355,393,431,469,507,900,919,938,957,1059,1069,1079,1107,1112,1121,1127,1129);
$top_chap2_только_закрытые_верх = array(249,283,368,406,444,479,517,904,925,944,962,1062,1072,1081,1108,1114,1122,1127,1129);

$top_chap3_только_открытые_низ = array(319,327,357,365,395,401,433,439,471,509,920,939,958,1069,1079,1112,1121,1127,1129);
$top_chap3_только_открытые_верх = array(325,330,363,368,399,403,437,441,475,513,925,943,960,1072,1080,1114,1122,1127,1129);

$top_chap3_только_закрытые_низ = array(241,248,317,355,393,431,469,507,900,919,938,957,1059,1069,1079,1107,1112,1121,1127,1129);
$top_chap3_только_закрытые_верх = array(245,254,330,368,404,442,477,515,906,925,944,961,1062,1072,1081,1109,1114,1122,1127,1129);

$top_chap4_низ = array(241,247,317,355,393,436,474,512,550,900,919,938,959,978,1059,1069,1080,1107,1112,1121,1127,1129);
$top_chap4_верх = array(245,250,330,368,406,441,479,514,552,906,925,944,962,980,1062,1072,1081,1109,1114,1122,1127,1129);

$top_chap5_только_открытые_низ = array(318,321,356,359,365,396,403,434,439,477,515,919,924,939,942,961,1069,1081,1112,1121,1127,1129);
$top_chap5_только_открытые_верх = array(319,322,357,360,366,397,404,435,439,477,515,921,924,940,943,961,1071,1081,1113,1122,1127,1129);

$top_chap5_только_закрытые_низ = array(246,280,318,325,356,394,432,439,470,477,508,515,900,919,938,957,1059,1069,1079,1107,1112,1121,1127,1129);
$top_chap5_только_закрытые_верх = array(249,281,322,329,366,404,435,442,474,480,512,518,906,925,943,962,1062,1072,1082,1108,1114,1122,1127,1129);

$top_chap6_только_открытые_низ = array(278,316,354,392,430,468,506,544,899,918,937,956,975,1058,1068,1078,1107,1112,1121,1127,1129);
$top_chap6_только_открытые_верх = array(292,330,368,406,444,474,512,550,906,925,944,959,978,1062,1072,1080,1109,1114,1122,1127,1129);

$top_chap6_только_закрытые_низ = array(245,278,316,354,392,430,468,506,544,899,918,937,956,975,1058,1068,1078,1107,1112,1121,1127,1129);
$top_chap6_только_закрытые_верх = array(249,292,330,368,406,444,474,512,550,906,925,944,959,978,1062,1072,1080,1109,1114,1122,1127,1129);




$top_thum_открыт_низ = array(249,278,316,321,355,359,367,393,398,401,432,436,440,468,506,544,899,918,938,940,956,975,1058,1068,1078,1107,1112,1121,1127,1129);
$top_thum_открыт_верх = array(255,293,319,331,357,365,369,394,399,403,432,437,441,483,521,552,907,926,938,943,964,979,1062,1072,1082,1109,1114,1122,1127,1129);

$top_thum_закрыт_низ = array(240,278,316,354,392,430,468,506,544,899,918,937,956,975,1058,1068,1078,1107,1112,1121,1127,1129);
$top_thum_закрыт_верх = array(255,293,331,369,407,445,483,521,554,907,926,945,964,980,1062,1072,1082,1109,1114,1122,1127,1129);

$top001_низ = array(33,112,132,206,231,246,270,296,379,405,431,450,481,488,495,508,512,516);
$top001_верх = array(45,114,145,223,244,247,273,297,385,411,439,452,484,491,499,510,514,518);

$LR0039_низ = array(3,12,21,30,41,50,56,61,67,70,74,76,78);
$LR0039_верх = array(4,13,22,35,44,53,56,63,68,71,74,76,78);

$LR0040_низ = array(1,5,10,14,19,23,28,37,46,55,57,60,65,70,73,76,78);
$LR0040_верх = array(2,6,11,15,20,24,31,40,49,55,57,62,66,71,73,76,78);

$LR0041_низ = array(5,14,19,23,28,39,43,48,52,57,60,66,68,70,73,76,78);
$LR0041_верх = array(6,15,20,24,35,40,44,49,53,57,63,66,68,71,74,76,78);

$LR0042_низ = array(1,10,19,30,39,48,55,60,66,70,73,76,78);
$LR0042_верх = array(4,13,22,33,42,51,56,62,67,71,74,76,78);

$LR0043_низ = array(5,14,23,28,34,37,43,46,52,57,60,65,68,70,73,76,78);
$LR0043_верх = array(8,17,26,31,35,40,44,49,53,58,63,66,68,71,74,76,78);

$LR0044_низ = array(21,30,41,50,61,67,70,74,76,78);
$LR0044_верх = array(22,33,42,51,62,67,71,74,76,78);

$LR0045_низ = array(1,10,19,30,41,50,55,60,67,70,74,76,78);
$LR0045_верх = array(2,11,22,33,42,51,55,62,67,71,74,76,78);

$LR0046_низ = array(7,16,19,25,28,39,48,58,60,63,66,70,73,76,78);
$LR0046_верх = array(8,17,20,26,31,40,49,58,61,63,66,71,73,76,78);

$LR0047_низ = array(5,14,21,30,34,43,52,57,61,68,70,74,76,78);
$LR0047_верх = array(8,17,26,31,35,44,53,58,63,68,71,74,76,78);

$LR0050_низ = array(16,17,25,26,58,63,71,76,78);
$LR0050_верх = array(16,17,25,26,58,63,71,76,78);

$LR0051_низ = array(7,8,16,17,58,71,76,78);
$LR0051_верх = array(7,8,16,17,58,71,76,78);

$LR0052_низ = array(39,40,48,49,66,73,76,78);
$LR0052_верх = array(39,40,48,49,66,73,76,78);

$LR0054_низ = array(19,20,28,29,37,38,60,65,70,73,76,78);
$LR0054_верх = array(19,20,28,29,37,38,60,65,70,73,76,78);



$LR0055_низ = array(5,6,14,15,57,71,76,78);
$LR0055_верх = array(5,6,14,15,57,71,76,78);


$LR0057_низ = array(23,24,32,33,41,42,62,67,71,74,76,78);
$LR0057_верх = array(23,24,32,33,41,42,62,67,71,74,76,78);


$LR0058_низ = array(7,8,16,17,23,24,32,33,41,42,58,62,67,71,74,76,78);
$LR0058_верх = array(7,8,16,17,23,24,32,33,41,42,58,62,67,71,74,76,78);


$LR0060_низ = array(7,8,16,17,37,38,46,47,58,65,71,73,76,78);
$LR0060_верх = array(7,8,16,17,37,38,46,47,58,65,71,73,76,78);


$LR0063_низ = array(10,11,19,20,55,60,70,76,78);
$LR0063_верх = array(10,11,19,20,55,60,70,76,78);


$LR0064_низ = array(16,17,25,26,58,63,71,76,78);
$LR0064_верх = array(16,17,25,26,58,63,71,76,78);

$закрыто_справа_низ = array(5,14,23,32,41,50,47,62,67,71,74);
$закрыто_справа_верх = array(9,18,27,36,45,54,59,64,69,72,78);
//LR0082,91,104,108,129,169


$закрыто_слева_низ = array(1,10,19,28,37,46,55,60,62,70,73,76,78);
$закрыто_слева_верх = array(5,14,23,32,41,50,57,62,67,71,73,76,78);
//88,115,156



$входящий_файл = $file = basename($argv['1'], ".png");

if(substr_count($входящий_файл, "LR") > "0") $тип_картинки = $простые_листы;
if(substr_count($входящий_файл, "top_") > "0") $тип_картинки = $top_chap;
if(substr_count($входящий_файл, "top0") > "0") $тип_картинки = $top0001;


$_ab = "";
if(substr_count($входящий_файл, "����") > "0" )$_ab = "_a";
if(substr_count($входящий_файл, "����") > "0" ) $_ab = "_b";

 /*
                                                                                     //закр
if(substr_count($входящий_файл, "top_chap3") > "0" AND substr_count($входящий_файл, "����") > "0" ) {
	$низ = $top_chap4_только_закрытые_низ;
	$верх = $top_chap4_только_закрытые_верх;
	}else
	{
	
	$низ = $top_chap3_только_открытые_низ ;
	$верх = $top_chap3_только_открытые_верх ;
	
	}

*/
copy($argv['1'],"temp_fbdd.png");
$счётчик = 1;

foreach($тип_картинки as $ширина => $высота)
{
if($счётчик != 1) resize( $argv['1'], 'temp_fbdd.png', $ширина, $высота,false);

//нарезка только нужных кусков
//$счётчик = нарезка_частич(координаты($ширина),координаты($высота),$счётчик,$argv['1'],$top_thum_закрыт_низ ,$top_thum_закрыт_верх,$_ab );
$счётчик = нарезка(координаты($ширина),координаты($высота),$счётчик,$argv['1'],$_ab); //нарезка всего файла

}



unlink('temp_fbdd.png');

function нарезка_частич($горизонт, $вертикаль, $счётчик, $папка_вых,$диапаз_низ, $диапаз_верх,$prefix){

$папка = pathinfo ($папка_вых); 
@mkdir($папка["filename"]);

foreach($вертикаль as $нач_вер => $кон_вер){

	foreach($горизонт as $нач_гор => $кон_гор)
	{
		foreach($диапаз_низ as $ключ => $низ){
			
			if($счётчик >= $низ AND $счётчик <= $диапаз_верх[$ключ ]){
			crop("temp_fbdd.png", $папка["filename"]."\\".str_pad($счётчик, 4,"0",STR_PAD_LEFT).$prefix.".png", array($нач_гор , $нач_вер, $кон_гор, $кон_вер),false);
			echo $счётчик."\r\n"; 
											}
			}
			
	$счётчик++;
	}

}
return $счётчик;
}

function нарезка($горизонт, $вертикаль, $счётчик, $папка_вых){

$папка = pathinfo ($папка_вых); 
@mkdir($папка["filename"]);

foreach($вертикаль as $нач_вер => $кон_вер){

	foreach($горизонт as $нач_гор => $кон_гор)
	{
		
			crop("temp_fbdd.png", $папка["filename"]."\\".str_pad($счётчик, 4,"0",STR_PAD_LEFT)."_a.png", array($нач_гор , $нач_вер, $кон_гор, $кон_вер),false);
			echo $счётчик."\r\n"; 
											
			
	$счётчик++;
	}

}
return $счётчик;
}

function координаты($размер_стороны){

	for ($x=0; $x<$размер_стороны; $x+=256) {
	$горизонт[$x] = $x+256;
	if($x+256>$размер_стороны) $горизонт[$x] = $x+($размер_стороны%256);
}

return $горизонт;

}



//маштабирования функция
function resize($file_input, $file_output, $w_o, $h_o, $percent = false) {
	list($w_i, $h_i, $type) = getimagesize($file_input);
	if (!$w_i || !$h_i) {
		echo 'Невозможно получить длину и ширину изображения';
		return;
        }
        $types = array('','gif','jpeg','png');
        $ext = $types[$type];
        if ($ext) {
    	        $func = 'imagecreatefrom'.$ext;
    	        $img = $func($file_input);
        } else {
    	        echo 'Некорректный формат файла';
		return;
        }
	if ($percent) {
		$w_o *= $w_i / 100;
		$h_o *= $h_i / 100;
	}
	if (!$h_o) $h_o = $w_o/($w_i/$h_i);
	if (!$w_o) $w_o = $h_o/($h_i/$w_i);

	$img_o = imagecreatetruecolor($w_o, $h_o);
	imagecopyresampled($img_o, $img, 0, 0, 0, 0, $w_o, $h_o, $w_i, $h_i);
	if ($type == 2) {
		return imagejpeg($img_o,$file_output,100);
	} else {
		$func = 'image'.$ext;
		return $func($img_o,$file_output);
	}
}
//обрезки функция
function crop($file_input, $file_output, $crop = 'square',$percent = false) {
	list($w_i, $h_i, $type) = getimagesize($file_input);
	if (!$w_i || !$h_i) {
		echo 'Невозможно получить длину и ширину изображения';
		return;
        }
        $types = array('','gif','jpeg','png');
        $ext = $types[$type];
        if ($ext) {
    	        $func = 'imagecreatefrom'.$ext;
    	        $img = $func($file_input);
        } else {
    	        echo 'Некорректный формат файла';
		return;
        }
	if ($crop == 'square') {
		$min = $w_i;
		if ($w_i > $h_i) $min = $h_i;
		$w_o = $h_o = $min;
	} else {
		list($x_o, $y_o, $w_o, $h_o) = $crop;
		if ($percent) {
			$w_o *= $w_i / 100;
			$h_o *= $h_i / 100;
			$x_o *= $w_i / 100;
			$y_o *= $h_i / 100;
		}
    	        if ($w_o < 0) $w_o += $w_i;
	        $w_o -= $x_o;
	   	if ($h_o < 0) $h_o += $h_i;
		$h_o -= $y_o;
	}
	$img_o = imagecreatetruecolor($w_o, $h_o);
	imagecopy($img_o, $img, 0, 0, $x_o, $y_o, $w_o, $h_o);
	if ($type == 2) {
		return imagejpeg($img_o,$file_output,100);
	} else {
		$func = 'image'.$ext;
		return $func($img_o,$file_output);
	}
}

//взято с http://recens.ru/php/resize_and_crop.html

/*
Делим изображение на 4 равные части:

crop('big.jpeg', '1.jpeg', array(0, 0, 50, 50),true);
crop('big.jpeg', '2.jpeg', array(50, 0, 100, 50),true);
crop('big.jpeg', '3.jpeg', array(0, 50, 50, 100),true);
crop('big.jpeg', '4.jpeg', array(50, 50, 100, 100),true);
*/
?>